1s/ERP/extensions/liko/Catalogs/Лико_Стеллажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Лико_Стеллажи</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МинГлубинаПаллета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоСекций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МаксГлубинаПаллета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСтеллажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Узкопроходный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МинШиринаПаллета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МаксШиринаПаллета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоЗонПриемкиОтгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗоныПриемкиОтгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АдресХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/extensions/liko/CommonModules/Лико_WMS_Сервер/Ext/Module.bsl
//+Лико m.shenderov 17.07.2026

#Область WMS_API

// ============================================================================
// Хелперы — общие
// ============================================================================

Функция HttpВернутьОшибку_WMS(КодОшибки, Сообщение)

	СтруктураОшибка = Новый Структура;
	СтруктураОшибка.Вставить("code", КодОшибки);
	СтруктураОшибка.Вставить("message", Сообщение);

	СтруктураОтвет = Новый Структура;
	СтруктураОтвет.Вставить("ok", Ложь);
	СтруктураОтвет.Вставить("error", СтруктураОшибка);

	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.СтруктураВJSON(СтруктураОтвет));

КонецФункции

Функция СсылкаПоСтрокеGUID(СтрокаGUID, ИмяМетаданных)

	Попытка
		УИД = Новый УникальныйИдентификатор(СтрокаGUID);
		Возврат Метаданные.НайтиПоПолномуИмени(ИмяМетаданных).ПолучитьСсылку(УИД);
	Исключение
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

// ============================================================================
// WMS ProcName — экспортные функции (10 штук)
// ============================================================================

Функция WMS_CheckConnection(ПараметрыPOST) Экспорт

	// НАЗНАЧЕНИЕ:
	//   Проверка доступности WMS API. Возвращает версию модуля и timestamp.
	//   Используется веб-приложением для health-check при старте.
	//
	// ПАРАМЕТРЫ:
	//   ПараметрыPOST — Структура (не используется, но требуется сигнатурой Liko_Rest).
	//
	// ВОЗВРАТ:
	//   HTTP-ответ 200 с JSON: { ok: true, version: "1.0.0", timestamp: "..." }

	СтруктураОтвет = Новый Структура;
	СтруктураОтвет.Вставить("ok", Истина);
	СтруктураОтвет.Вставить("version", "1.0.0");
	СтруктураОтвет.Вставить("timestamp", ТекущаяДата());

	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.СтруктураВJSON(СтруктураОтвет));

КонецФункции

Функция ЦветСтеллажа(НомерСтеллажа)

	// Фиксированная палитра из 9 цветов для стеллажей 1-9
	Цвета = Новый Соответствие;
	Цвета.Вставить(1, "#E8C98A");  // светло-жёлтый
	Цвета.Вставить(2, "#A8D8B9");  // светло-зелёный
	Цвета.Вставить(3, "#B8D4E3");  // светло-голубой
	Цвета.Вставить(4, "#F0C8C8");  // светло-розовый
	Цвета.Вставить(5, "#D5C4E1");  // светло-фиолетовый
	Цвета.Вставить(6, "#F5DEB3");  // светло-пшеничный
	Цвета.Вставить(7, "#C8E6E6");  // светло-циан
	Цвета.Вставить(8, "#E8D5B7");  // светло-коричневый
	Цвета.Вставить(9, "#D4E4C8");  // светло-оливковый

	Если Цвета.Получить(НомерСтеллажа) <> Неопределено Тогда
		Возврат Цвета.Получить(НомерСтеллажа);
	КонецЕсли;

	Возврат "#CCCCCC";  // серый для стеллажей >9

КонецФункции

Функция WMS_GetWarehouses(ПараметрыPOST) Экспорт

	// НАЗНАЧЕНИЕ:
	//   Возвращает список складов, для которых есть хотя бы один стеллаж
	//   (Справочник.Лико_Стеллажи). Используется веб-приложением для
	//   выпадающего списка выбора склада.
	//
	// ВОЗВРАТ:
	//   { warehouses: [{ id, name, code }] }

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Склады.Ссылка КАК id,
	|	Склады.Наименование КАК name,
	|	Склады.Код КАК code
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Ссылка В
	|		(ВЫБРАТЬ
	|			Лико_Стеллажи.Склад
	|		ИЗ
	|			Справочник.Лико_Стеллажи КАК Лико_Стеллажи
	|		ГДЕ
	|			Лико_Стеллажи.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Склады.Наименование";

	ТЗ = Запрос.Выполнить().Выгрузить();

	СтруктураОтвет = Новый Структура;
	СтруктураОтвет.Вставить("ok", Истина);
	СтруктураОтвет.Вставить("warehouses", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗ));

	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.СтруктураВJSON(СтруктураОтвет));

КонецФункции

Функция WMS_GetRacks(ПараметрыPOST) Экспорт

	// НАЗНАЧЕНИЕ:
	//   Возвращает полную топологию всех стеллажей склада: этажи, типоразмеры,
	//   физические ограничения. Эти данные НЕ меняются при движении паллет —
	//   можно кэшировать на стороне веб-приложения (TTL 1 час).
	//
	// ПАРАМЕТРЫ:
	//   warehouse — строка, GUID склада (ключ в ПараметрыPOST).
	//
	// ВОЗВРАТ:
	//   { racks: [...] } — полная топология стеллажей с этажами.

	// --- Валидация параметров ---
	Если НЕ ПараметрыPOST.Свойство("warehouse") Тогда
		Возврат HttpВернутьОшибку_WMS("MISSING_PARAM", "Не передан параметр 'warehouse'");
	КонецЕсли;

	Склад = СсылкаПоСтрокеGUID(ПараметрыPOST.warehouse, "Справочник.Склады");
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Возврат HttpВернутьОшибку_WMS("INVALID_PARAM", "Склад не найден по GUID '" + ПараметрыPOST.warehouse + "'");
	КонецЕсли;

	// --- Запрос стеллажей ---
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лико_Стеллажи.Ссылка КАК id,
	|	Лико_Стеллажи.Наименование КАК name,
	|	Лико_Стеллажи.Код КАК code,
	|	Лико_Стеллажи.НомерСтеллажа КАК number,
	|	Лико_Стеллажи.Узкопроходный КАК narrowAisle,
	|	Лико_Стеллажи.МинШиринаПаллета КАК minPalletWidth,
	|	Лико_Стеллажи.МаксШиринаПаллета КАК maxPalletWidth,
	|	Лико_Стеллажи.МинГлубинаПаллета КАК minPalletDepth,
	|	Лико_Стеллажи.МаксГлубинаПаллета КАК maxPalletDepth,
	|	Лико_Стеллажи.КоличествоСекций КАК sectionsCount,
	|	3 КАК cellsPerSection,
	|	Лико_Стеллажи.КоличествоЗонПриёмки КАК floorZonesCount
	|ПОМЕСТИТЬ ВТ_Стеллажи
	|ИЗ
	|	Справочник.Лико_Стеллажи КАК Лико_Стеллажи
	|ГДЕ
	|	Лико_Стеллажи.Склад = &Склад
	|
	|УПОРЯДОЧИТЬ ПО
	|	Лико_Стеллажи.НомерСтеллажа";

	Запрос.УстановитьПараметр("Склад", Склад);
	ТЗ_Стеллажи = Запрос.Выполнить().Выгрузить();

	// --- Для каждого стеллажа загружаем этажи ---
	МассивСтеллажей = Новый Массив;

	Для Каждого СтрокаСтеллаж Из ТЗ_Стеллажи Цикл
		СтеллажСсылка = СтрокаСтеллаж.id;

		СтруктураСтеллаж = Новый Структура;
		СтруктураСтеллаж.Вставить("id", Строка(СтеллажСсылка.УникальныйИдентификатор()));
		СтруктураСтеллаж.Вставить("name", СтрокаСтеллаж.name);
		СтруктураСтеллаж.Вставить("code", СтрокаСтеллаж.code);
		СтруктураСтеллаж.Вставить("number", СтрокаСтеллаж.number);
		СтруктураСтеллаж.Вставить("narrowAisle", СтрокаСтеллаж.narrowAisle);
		СтруктураСтеллаж.Вставить("color", ЦветСтеллажа(СтрокаСтеллаж.number));
		СтруктураСтеллаж.Вставить("minPalletWidth", СтрокаСтеллаж.minPalletWidth);
		СтруктураСтеллаж.Вставить("maxPalletWidth", СтрокаСтеллаж.maxPalletWidth);
		СтруктураСтеллаж.Вставить("minPalletDepth", СтрокаСтеллаж.minPalletDepth);
		СтруктураСтеллаж.Вставить("maxPalletDepth", СтрокаСтеллаж.maxPalletDepth);
		СтруктураСтеллаж.Вставить("sectionsCount", СтрокаСтеллаж.sectionsCount);
		СтруктураСтеллаж.Вставить("cellsPerSection", 3);
		СтруктураСтеллаж.Вставить("floorZonesCount", СтрокаСтеллаж.floorZonesCount);

		// Этажи стеллажа (из ТЧ)
		МассивЭтажей = Новый Массив;
		СтеллажОбъект = СтеллажСсылка.ПолучитьОбъект();

		Для Каждого СтрокаЭтаж Из СтеллажОбъект.Этажи Цикл

			Типоразмер = СтрокаЭтаж.Типоразмер;
			СтруктураТипоразмер = Новый Структура;
			Если ЗначениеЗаполнено(Типоразмер) Тогда
				СтруктураТипоразмер.Вставить("id", Строка(Типоразмер.УникальныйИдентификатор()));
				СтруктураТипоразмер.Вставить("height", Типоразмер.Габарит.Высота);
				СтруктураТипоразмер.Вставить("width", Типоразмер.Габарит.Ширина);
				СтруктураТипоразмер.Вставить("depth", Типоразмер.Габарит.Глубина);
				СтруктураТипоразмер.Вставить("weight", Типоразмер.Грузоподъемность);
				СтруктураТипоразмер.Вставить("unlimitedWeight", Типоразмер.НеОграниченаПоГрузоподъемности);
			Иначе
				СтруктураТипоразмер.Вставить("id", "");
				СтруктураТипоразмер.Вставить("height", 0);
				СтруктураТипоразмер.Вставить("width", 0);
				СтруктураТипоразмер.Вставить("depth", 0);
				СтруктураТипоразмер.Вставить("weight", 0);
				СтруктураТипоразмер.Вставить("unlimitedWeight", Ложь);
			КонецЕсли;

			СтруктураЭтаж = Новый Структура;
			СтруктураЭтаж.Вставить("number", СтрокаЭтаж.НомерСтроки);
			СтруктураЭтаж.Вставить("typeSize", СтруктураТипоразмер);
			СтруктураЭтаж.Вставить("minDepthUnlimited", СтрокаЭтаж.МинимальнаяГлубинаНеОграничена);
			СтруктураЭтаж.Вставить("maxDepthUnlimited", СтрокаЭтаж.МаксимальнаяГлубинаНеОграничена);
			СтруктураЭтаж.Вставить("maxLiftWeight", СтрокаЭтаж.МаксимальныйВесПодъёмаНаЭтаж);
			СтруктураЭтаж.Вставить("heightClearance", СтрокаЭтаж.Зазор);
			СтруктураЭтаж.Вставить("beamHeight", СтрокаЭтаж.ВысотаБалки);
			СтруктураЭтаж.Вставить("heightFromFloor", СтрокаЭтаж.ВысотаОтПола);
			СтруктураЭтаж.Вставить("heightFromFloorFixed", СтрокаЭтаж.ВысотаОтПолаФиксирована);
			СтруктураЭтаж.Вставить("widthClearance", СтрокаЭтаж.ЗазорПоШирине);

			МассивЭтажей.Добавить(СтруктураЭтаж);
		КонецЦикла;

		СтруктураСтеллаж.Вставить("floors", МассивЭтажей);
		МассивСтеллажей.Добавить(СтруктураСтеллаж);
	КонецЦикла;

	СтруктураОтвет = Новый Структура;
	СтруктураОтвет.Вставить("ok", Истина);
	СтруктураОтвет.Вставить("racks", МассивСтеллажей);

	Возврат Лико_HTTP_Сервер.Ответ(Лико_HTTP_Сервер.СтруктураВJSON(СтруктураОтвет));

КонецФункции

#КонецОбласти
